In [1]:
import pandas as pd

In [2]:
def reindex_df(df):
    new_index= pd.Index(range(1,len(df)*2,2))
    df = df.set_index(new_index)
    return df

In [3]:
data = {"a":[1,2,3,4],
        "b":[5,6,7,8],
        "c":[9,10,11,12]}
df =pd.DataFrame(data)

In [4]:
df = reindex_df(df)
df

   a  b   c
1  1  5   9
3  2  6  10
5  3  7  11
7  4  8  12

In [5]:
data1 = {"values":[10,20,30,40]}
df = pd.DataFrame(data1)

In [6]:
df

   values
0      10
1      20
2      30
3      40

In [7]:
df['values'][0:3].sum()

60

In [8]:
df['values'][0:3].max()

30

In [9]:
df['values'][0:4].min()

10

In [10]:
df['values'].mean()

25.0

In [11]:
data = {"Text":["jyoti","english","hindi"]}
df = pd.DataFrame(data)

In [12]:
df

      Text
0    jyoti
1  english
2    hindi

In [13]:
df["Word_count"] = df["Text"].apply(lambda x:len(str(x)))

In [14]:
df

      Text  Word_count
0    jyoti           5
1  english           7
2    hindi           5

Q5:How are DataFrame .size() and DataFrame.shape() different?

Ans: DataFrame.size() returns the total number of elements in the dataframe which is calculated by multiplying the number of rows by the number of columns. It gives you the total size of the dataframe.

On the other hand , dataframe.shape() returns a tuple that represents the dimensions of the dataframe . It provides the number of rows and columns in the dataframe. The shape is expressed as (number of rows, number of columns).

Q6: Which function of pandas do we use to read an excel file?

Ans: pd.read_excel("filename...")

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.
The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username' column

In [15]:
import pandas as pd

In [16]:
data = {'Email':['john.doe@gmail.com','jyotiprava@gmail.com','prava@gmail.com']}
df = pd.DataFrame(data)

In [17]:
df

                  Email
0    john.doe@gmail.com
1  jyotiprava@gmail.com
2       prava@gmail.com

In [26]:
df['Username']=df['Email'].str.split('@').str[0]

In [27]:
df

                  Email    Username
0    john.doe@gmail.com    john.doe
1  jyotiprava@gmail.com  jyotiprava
2       prava@gmail.com       prava

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [37]:
def select_rows(df2):
    selected_rows=df2[(df2['a']>5)&(df2['b']<10)]
    return selected_rows

In [32]:
data2= {'a':[3,8,6,2,9], 
       'b':[5,2,9,3,1], 
       'c':[1,7,4,5,2]}
df2=pd.DataFrame(data2)

In [38]:
selected_df = select_rows(df2)
selected_df

   a  b  c
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [39]:
data3={'Values':[23,45,67,89,45,67,69]}
df3= pd.DataFrame(data3)

In [40]:
df3

   Values
0      23
1      45
2      67
3      89
4      45
5      67
6      69

In [41]:
#mean
df3.mean()

Values    57.857143
dtype: float64

In [42]:
#median
df3.median()

Values    67.0
dtype: float64

In [43]:
#standard deviation 
df3.std()

Values    21.628905
dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [58]:
date= pd.date_range(start='2024-01-01',end='2024-01-07')
data4= {'Sales':[234,56,78,45,67,56,78],
       'Date':date}
df4=pd.DataFrame(data4)

In [59]:
df4

   Sales       Date
0    234 2024-01-01
1     56 2024-01-02
2     78 2024-01-03
3     45 2024-01-04
4     67 2024-01-05
5     56 2024-01-06
6     78 2024-01-07

In [60]:
df4['MovingAverage']= df4['Sales'].mean()

In [61]:
df4

   Sales       Date  MovingAverage
0    234 2024-01-01      87.714286
1     56 2024-01-02      87.714286
2     78 2024-01-03      87.714286
3     45 2024-01-04      87.714286
4     67 2024-01-05      87.714286
5     56 2024-01-06      87.714286
6     78 2024-01-07      87.714286

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.
For example, if df contains the following values:
Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
Your function should create the following DataFrame:

Date Weekday
0 2023-01-01 Sunday
1 2023-01-02 Monday
2 2023-01-03 Tuesday
3 2023-01-04 Wednesday
4 2023-01-05 Thursday
The function should return the modified DataFrame.

In [63]:
date= pd.date_range(start='2024-01-01',end='2024-01-05')
data5= {'Date':date}
df5=pd.DataFrame(data5)

In [64]:
df5

        Date
0 2024-01-01
1 2024-01-02
2 2024-01-03
3 2024-01-04
4 2024-01-05

In [68]:
df5['Weekday']=df5['Date'].dt.day_name()

In [69]:
df5

        Date    Weekday
0 2024-01-01     Monday
1 2024-01-02    Tuesday
2 2024-01-03  Wednesday
3 2024-01-04   Thursday
4 2024-01-05     Friday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [70]:
date= pd.date_range(start='2024-01-01',end='2024-01-31')
df6= pd.DataFrame({'Date':date})

In [72]:
df6= pd.to_datetime(date)

In [73]:
df6

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05', '2024-01-06', '2024-01-07', '2024-01-08',
               '2024-01-09', '2024-01-10', '2024-01-11', '2024-01-12',
               '2024-01-13', '2024-01-14', '2024-01-15', '2024-01-16',
               '2024-01-17', '2024-01-18', '2024-01-19', '2024-01-20',
               '2024-01-21', '2024-01-22', '2024-01-23', '2024-01-24',
               '2024-01-25', '2024-01-26', '2024-01-27', '2024-01-28',
               '2024-01-29', '2024-01-30', '2024-01-31'],
              dtype='datetime64[ns]', freq='D')